const Header = () => {
  return (
    <>
      <div className="container mx-auto bg-white border-b border-naturalgray-1 sm:border-0 px-4 py-3 gap-3 flex flex-col justify-between items-center sm:mt-4 lg:mt-6 xl:mt-8">
        <div className="w-full h-[32px] flex justify-between">
          <div className="h-[32px] flex justify-between sm:justify-start items-center gap-3 sm:gap-6 sm:w-full">
            <button className="bg-naturalgray-1 size-8 rounded-lg px-1.5 gap-1 sm:hidden">
              <svg
                width="20"
                height="20"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M3 18H21V16H3V18ZM3 13H21V11H3V13ZM3 6V8H21V6H3Z"
                  fill="#2E303B"
                />
              </svg>
            </button>
            <div>
              <svg
                className="sm:w-[130px] sm:h-[18px] xl:w-[180px] xl:h-[22px] 2xl:w-[200px] 2xl:h-[24px]"
                width="133"
                height="16"
                viewBox="0 0 133 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M8.33296 0.0246582C6.72805 0.0246582 5.29185 0.368056 4.02506 1.04554C2.75839 1.72302 1.77194 2.66943 1.06391 3.88293C0.355761 5.09643 -0.00012207 6.47419 -0.00012207 8.02274C-0.00012207 9.57129 0.355761 10.9495 1.06391 12.1556C1.77194 13.3616 2.75839 14.3014 4.02506 14.9789C5.29185 15.6563 6.72805 15.9997 8.33296 15.9997C10.3 15.9997 11.9845 15.5106 13.385 14.5353C14.267 13.9209 14.9396 13.1408 15.4533 12.24L12.3508 10.5222H11.7555C11.4251 11.1773 10.9551 11.6793 10.3493 12.0218C9.74349 12.3643 9.05943 12.5357 8.28841 12.5357C7.04525 12.5357 6.03121 12.1226 5.26019 11.3037C4.48917 10.4847 4.10694 9.39269 4.10694 8.02274C4.10694 6.65289 4.48917 5.56085 5.26019 4.7419C6.03121 3.92295 7.04525 3.50978 8.28841 3.50978C9.05943 3.50978 9.74349 3.68132 10.3493 4.02375C10.6596 4.19914 10.9296 4.42108 11.1678 4.67855L14.7242 2.75642C14.333 2.29457 13.9036 1.86717 13.385 1.50322C11.9845 0.520545 10.3 0.0246582 8.33296 0.0246582Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M26.6251 -0.000244141C25.1558 -0.000244141 23.8075 0.341454 22.5832 1.02379C21.3589 1.70622 20.3838 2.6553 19.664 3.87167C18.9443 5.08814 18.5834 6.46122 18.5834 7.98922C18.5834 9.51722 18.9443 10.8899 19.664 12.1137C20.3838 13.3376 21.3589 14.2932 22.5832 14.9757C23.8075 15.658 25.1559 15.9997 26.6251 15.9997C28.0943 15.9997 29.436 15.658 30.653 14.9757C31.8699 14.2932 32.8317 13.3375 33.5441 12.1137C34.2563 10.8899 34.6106 9.51722 34.6106 7.98922C34.6106 6.46122 34.263 5.08814 33.5581 3.87167C32.8532 2.6553 31.8843 1.70622 30.66 1.02379C29.4356 0.341454 28.0943 -0.000244141 26.6251 -0.000244141ZM26.6251 3.45086C27.8717 3.45086 28.865 3.86207 29.6145 4.68535C30.3638 5.50873 30.7371 6.60952 30.7371 7.98922C30.7371 9.35399 30.3638 10.4483 29.6145 11.279C28.865 12.1098 27.8717 12.5276 26.6251 12.5276C25.3636 12.5276 24.3572 12.1164 23.6077 11.293C22.8582 10.4697 22.4779 9.36881 22.4779 7.98922C22.4779 6.5947 22.8582 5.4873 23.6077 4.67138C24.3572 3.85546 25.3637 3.45086 26.6251 3.45086Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M37.7412 8.15356V15.9992H41.5445L41.5746 13.4586L37.7412 8.15356Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M37.7416 0.378174V1.57759L47.2394 15.9994H51.7198V15.9853L41.4045 0.378174H37.7416Z"
                  fill="#0D6EFD"
                />
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M37.7406 0.377884C37.7406 0.377505 37.7409 0.377197 37.7413 0.377197H41.4052L41.4048 0.377505L51.7203 15.985H51.7202V15.9991C51.7202 15.9995 51.7199 15.9998 51.7195 15.9998H47.2381L47.2385 15.9995L37.7405 1.57729H37.7406V0.377884ZM37.742 0.37857V1.57709L47.2395 15.9984H51.7188V15.9853L41.4038 0.37857H37.742Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M47.9158 0.378174V3.61882L51.7191 9.37077V0.378174H47.9158Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M62.7097 0.0837402C61.1959 0.0837402 59.8414 0.425867 58.6468 1.10084C57.4521 1.77582 56.5218 2.71871 55.8539 3.92772C55.1861 5.13673 54.8505 6.50939 54.8505 8.0522C54.8505 9.59502 55.1861 10.9681 55.8539 12.1698C56.5218 13.3713 57.4521 14.3076 58.6468 14.9826C59.8414 15.6575 61.1959 15.9997 62.7097 15.9997C64.5648 15.9997 66.1535 15.5123 67.4743 14.5406C67.9635 14.1808 68.3755 13.7505 68.7445 13.2921L65.4183 11.342C65.1865 11.6149 64.9181 11.8532 64.6114 12.0365C64.04 12.3777 63.3948 12.5484 62.6676 12.5484C61.4952 12.5484 60.5458 12.1369 59.8186 11.321C59.0914 10.5051 58.7239 9.41708 58.7239 8.0522C58.7239 6.68743 59.0914 5.59943 59.8186 4.78351C60.5458 3.9676 61.4952 3.55596 62.6676 3.55596C63.3948 3.55596 64.04 3.72686 64.6114 4.06803C65.004 4.30247 65.3168 4.64044 65.5868 5.02201L68.9761 3.09304C68.5602 2.51199 68.0656 1.99512 67.4743 1.55683C66.1535 0.577791 64.5648 0.0837402 62.7097 0.0837402Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M72.106 6.39795V9.60811H83.1094V6.39795H72.106Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M72.106 0.0419922V3.25215H83.1094V0.0419922H72.106Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M72.106 12.7898V16.0001H83.1094V12.7898H72.106Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M86.2385 0.378662V3.45097H90.0418V3.44404H92.1118C92.839 3.44404 93.3837 3.61483 93.7398 3.956C94.0961 4.29727 94.2732 4.78503 94.2732 5.40809C94.2732 6.03114 94.0961 6.51187 93.7398 6.85303C93.3837 7.1942 92.839 7.3651 92.1118 7.3651H91.6698H86.2385V15.9999H90.0418V10.3884H92.4066C93.6829 10.3884 94.7457 10.1607 95.6064 9.70091C96.4671 9.24098 97.1066 8.63328 97.5222 7.8842C97.9377 7.13503 98.1466 6.31292 98.1466 5.40809C98.1466 4.42894 97.9314 3.55524 97.501 2.7987C97.0707 2.04206 96.4251 1.45419 95.5643 1.024C94.7036 0.593811 93.6532 0.378662 92.4066 0.378662H86.2385Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M101.277 0.378418V3.42268H105.417V15.9997H109.22V3.42268H113.36V0.378418H101.277Z"
                  fill="#0D6EFD"
                />
                <path
                  d="M124.525 -0.000244141C123.055 -0.000244141 121.714 0.341454 120.49 1.02379C119.265 1.70622 118.291 2.6553 117.571 3.87167C116.851 5.08814 116.49 6.46122 116.49 7.98922C116.49 9.51722 116.851 10.8899 117.571 12.1137C118.291 13.3376 119.265 14.2932 120.49 14.9757C121.714 15.658 123.055 15.9997 124.525 15.9997C125.993 15.9997 127.342 15.658 128.559 14.9757C129.776 14.2932 130.738 13.3375 131.451 12.1137C132.163 10.8899 132.517 9.51722 132.517 7.98922C132.517 6.46122 132.17 5.08814 131.465 3.87167C130.76 2.6553 129.791 1.70622 128.567 1.02379C127.342 0.341454 125.993 -0.000244141 124.525 -0.000244141ZM124.525 3.45086C125.771 3.45086 126.772 3.86207 127.521 4.68535C128.27 5.50873 128.644 6.60952 128.644 7.98922C128.644 9.35399 128.27 10.4483 127.521 11.279C126.772 12.1098 125.771 12.5276 124.525 12.5276C123.263 12.5276 122.264 12.1164 121.514 11.293C120.765 10.4697 120.384 9.36881 120.384 7.98922C120.384 6.5947 120.765 5.4873 121.514 4.67138C122.264 3.85546 123.263 3.45086 124.525 3.45086Z"
                  fill="#0D6EFD"
                />
              </svg>
            </div>
            <input
              className="w-full h-10 rounded-lg pr-10 p-3 gap-2 bg-naturalgray-1 text-sm bg-[url(assets/icons/searchicon.png)] bg-no-repeat bg-position-[96%center] hidden sm:block 2xl:h-12 sm:max-w-[360px] md:max-w-[400px] lg:max-w-[440px]"
              type="text"
              placeholder="جستوجو کسب و کار"
            ></input>
          </div>
          <div className="flex justify-between items-center h-[32px] gap-2 ">
            <button className="bg-Primary size-8 rounded-lg px-1.5 gap-1 lg:h-10 xl:h-12 lg:w-auto lg:px-2 xl:px-3.5 2xl:px-4 lg:flex lg:flex-row-reverse lg:gap-2 lg:items-center">
              <p className="hidden text-white lg:block text-[13px] xl:text-[14px] 2xl:text-[18px] font-iransansx text-nowrap leading-[180%]">
                رایگان شروع کن!
              </p>
              <svg
                className="lg:size-6"
                width="20"
                height="20"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M10.9956 21H9.99558L10.9956 14H7.49558C6.61558 14 7.16558 13.25 7.18558 13.22C8.47558 10.94 10.4156 7.54 13.0056 3H14.0056L13.0056 10H16.5156C16.9156 10 17.1356 10.19 16.9156 10.66C12.9656 17.55 10.9956 21 10.9956 21Z"
                  fill="#ffffff"
                />
              </svg>
            </button>
            <button className="size-8 border rounded-lg border-naturalgray-3 px-1.5 gap-1 lg:h-10 xl:h-12 lg:w-auto lg:px-2 xl:px-3.5 2xl:px-4 lg:flex lg:flex-row-reverse lg:gap-2 lg:items-center">
              <p className="hidden lg:block text-[13px] xl:text-[14px] 2xl:text-[18px] font-iransansx text-nowrap leading-[180%]">
                ورود/ثبت نام
              </p>
              <svg
                className="lg:size-6"
                width="20"
                height="20"
                viewBox="0 0 24 24"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M11 7L9.6 8.4L12.2 11H2V13H12.2L9.6 15.6L11 17L16 12L11 7ZM20 19H12V21H20C21.1 21 22 20.1 22 19V5C22 3.9 21.1 3 20 3H12V5H20V19Z"
                  fill="#2E303B"
                />
              </svg>
            </button>
          </div>
        </div>
        <input
          className="w-full h-10 rounded-lg pr-10 p-3 gap-2 bg-naturalgray-1 text-sm bg-[url(assets/icons/searchicon.png)] bg-no-repeat bg-position-[96%center] sm:hidden"
          type="text"
          placeholder="جستوجو کسب و کار"
        ></input>
        <div className="w-full gap-8 hidden sm:flex sm:justify-center md:justify-start py-2">
          <button className="rounded-xl h-10">
            <p className="text-naturalgray-8 font-iransansx text-[14px] xl:text-[15px] 2xl:text-[16px] text-nowrap leading-[180%]">
              شرکت‌ها
            </p>
          </button>
          <button className="rounded-xl h-10">
            <p className="text-naturalgray-8 font-iransansx text-[14px] xl:text-[15px] 2xl:text-[16px] text-nowrap leading-[180%]">
              فرصت های شغلی
            </p>
          </button>
          <button className="rounded-xl h-10">
            <p className="text-naturalgray-8 font-iransansx text-[14px] xl:text-[15px] 2xl:text-[16px] text-nowrap leading-[180%]">
              اخبار و رویدادها
            </p>
          </button>
          <button className="rounded-xl h-10">
            <p className="text-naturalgray-8 font-iransansx text-[14px] xl:text-[15px] 2xl:text-[16px] text-nowrap leading-[180%]">
              درباره ما
            </p>
          </button>
          <button className="rounded-xl h-10">
            <p className="text-naturalgray-8 font-iransansx text-[14px] xl:text-[15px] 2xl:text-[16px] text-nowrap leading-[180%]">
              تماس با ما
            </p>
          </button>
        </div>
      </div>
    </>
  );
};

export default Header;
